tutorials/shockFluid/diffuserIntake/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "(U|e|k|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;

        tolerance       1e-7;
        relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors 1;
}

// ************************************************************************* //
